app/views/comics/_form.html.erb

SELECT  "categories".* FROM "categories"  ORDER BY "categories"."id" ASC LIMIT 1
---
  <div class="col-md-8">
    <%= f.collection_select(:category_id, Category.all, :id, :name) %>