app/views/comics/index.html.erb

        <td><%= comic.author %></td>
        <td><%= Category.find(comic.category_id).name if comic.category_id.present?%></td>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]