app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "comics"], ["created_at", "2018-01-09 15:51:04.622155"], ["updated_at", "2018-01-09 15:51:04.622155"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save