app/controllers/comics_controller.rb

  def index
    @comics = Comic.all
---
SELECT  "comics".* FROM "comics"  ORDER BY "comics"."id" DESC LIMIT 1

  def create
    @comic = Comic.new(comic_params)
    respond_to do |format|
      if @comic.save
---
INSERT INTO "comics" ("title", "author", "price", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "abc"], ["author", "asd"], ["price", 23.0], ["description", "qwe"], ["rating", 5.0], ["created_at", "2018-01-09 15:42:40.980692"], ["updated_at", "2018-01-09 15:42:40.980692"]]

  def update
    respond_to do |format|
      if @comic.update(comic_params)
---
UPDATE "comics" SET "rating" = ?, "updated_at" = ? WHERE "comics"."id" = ?  [["rating", 5.1], ["updated_at", "2018-01-09 15:42:51.552456"], ["id", 1]]

  def destroy
    @comic.destroy
---
DELETE FROM "comics" WHERE "comics"."id" = ?  [["id", 6]]

    def set_comic
      @comic = Comic.find(params[:id])
---
SELECT  "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT 1  [["id", 6]]